taski/app/controllers/projects/tasks_controller.rb

INSERT INTO "tasks" ("title", "description", "project_id", "created_at", "updated_at", "completed", "task_file") VALUES (?, ?, ?, ?, ?, ?, ?)  [["title", "asdfds"], ["description", "teste"], ["project_id", 1], ["created_at", "2022-02-14 00:41:38.944621"], ["updated_at", "2022-02-14 00:41:38.944621"], ["completed", 0], ["task_file", nil]]
---
  def create
    @task = Task.new(task_params)
    @task.project_id = @project.id

    respond_to do |format|
      if @task.save

UPDATE "tasks" SET "title" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["title", "asdfdse"], ["updated_at", "2022-02-14 01:05:32.600416"], ["id", 4]]
---
  def update

    respond_to do |format|
      if @task.update(task_params)

SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_project
      @project = Project.find(params[:project_id])