taski/app/controllers/pages_controller.rb

  def home
    @projects = Project.all.limit(100)
---
SELECT "projects".* FROM "projects" LIMIT ?  [["LIMIT", 100]]