taski/app/controllers/projects_controller.rb

SELECT "projects".* FROM "projects" WHERE (percent_complete <= 75.0)
---
  def index
    @projects = Project.all

INSERT INTO "projects" ("title", "description", "percent_complete", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Project 1"], ["description", "Some Random Project"], ["percent_complete", nil], ["created_at", "2022-02-12 19:34:51.970179"], ["updated_at", "2022-02-12 19:34:51.970179"]]
---
  def create
    @project = Project.new(project_params)

    respond_to do |format|
      if @project.save

UPDATE "projects" SET "percent_complete" = ?, "updated_at" = ? WHERE "projects"."id" = ?  [["percent_complete", 100.0], ["updated_at", "2022-02-13 08:32:40.289984"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @project.update(project_params)